## Pandas Group By

## Grouping

In [1]:
import pandas as pd
import numpy as np
people_df=pd.read_csv("data/people.csv")

In [2]:
people_df

    name  age country
0    Pol   22      ES
1   Javi   20      ES
2  Maria   23      AR
3   Anna   24      FR
4   Anna   24      UK
5   Javi   30      MA
6    Dog    2      XX

In [3]:
people_df.groupby("name").mean()

        age
name
Anna   24.0
Dog     2.0
Javi   25.0
Maria  23.0
Pol    22.0

In [4]:
people_df.groupby("name")

In [5]:
people_df.groupby("name").groups

{'Anna': [3, 4], 'Dog': [6], 'Javi': [1, 5], 'Maria': [2], 'Pol': [0]}

In [6]:
people_df

    name  age country
0    Pol   22      ES
1   Javi   20      ES
2  Maria   23      AR
3   Anna   24      FR
4   Anna   24      UK
5   Javi   30      MA
6    Dog    2      XX

In [7]:
people_df.groupby(["country","name"]).mean()

                age
country name
AR      Maria  23.0
ES      Javi   20.0
        Pol    22.0
FR      Anna   24.0
MA      Javi   30.0
UK      Anna   24.0
XX      Dog     2.0

In [8]:
def groups_avg(grps):
    return grps.mean() + 15

In [9]:
people_df.groupby("name")["age"].apply(groups_avg)

name
Anna     39.0
Dog      17.0
Javi     40.0
Maria    38.0
Pol      37.0
Name: age, dtype: float64

In [10]:
people_df.groupby("name")["age"].apply(lambda grps:grps.mean() +15)

name
Anna     39.0
Dog      17.0
Javi     40.0
Maria    38.0
Pol      37.0
Name: age, dtype: float64

In [11]:
people_df.groupby("name").apply(np.sum)

           name  age country
name
Anna   AnnaAnna   48    FRUK
Dog         Dog    2      XX
Javi   JaviJavi   50    ESMA
Maria     Maria   23      AR
Pol         Pol   22      ES

In [12]:
people_df.groupby("name").apply(lambda gp:gp.max() )

        name  age country
name
Anna    Anna   24      UK
Dog      Dog    2      XX
Javi    Javi   30      MA
Maria  Maria   23      AR
Pol      Pol   22      ES

In [21]:
people_df.groupby('name').agg(['max',"min"])

      age     country
      max min     max min
name
Anna   24  24      UK  FR
Dog     2   2      XX  XX
Javi   30  20      MA  ES
Maria  23  23      AR  AR
Pol    22  22      ES  ES

In [14]:
people_df

    name  age country
0    Pol   22      ES
1   Javi   20      ES
2  Maria   23      AR
3   Anna   24      FR
4   Anna   24      UK
5   Javi   30      MA
6    Dog    2      XX

In [15]:
people_df.groupby("country").agg({"age":["count","mean","min"],"name":"max"})

          age             name
        count  mean min    max
country
AR          1  23.0  23  Maria
ES          2  21.0  20    Pol
FR          1  24.0  24   Anna
MA          1  30.0  30   Javi
UK          1  24.0  24   Anna
XX          1   2.0   2    Dog

### - Splitting
- splitting Data Frame into sub groups by key value or values
- equal to "group By" in SQL. 

### - Applying
   - Aggregation
       - applying one or multiple functions in to the items within each subgroup.
   - Transformation
        - broadcasting the results into the original data frame
   - Filteration
        - equivelant to HAVING in SQL
        
### - Combining
    - combining the results to fit into the data pipeline and/or delivers the insights

In [22]:
from IPhython.display import Image

display.Image("res/grouping.png")

ModuleNotFoundError: No module named 'IPhython'

source:https://towardsdatascience.com/aggregation-transform-filter-how-and-when-to-use-them-31ed7eb88d2e